[{"id":"0.6922544383921607","title":" Monitor","desc":" Stunning Full HD display: Enjoy immaculate 16: 9 image quality with 2K QHD 2560x1440 resolution IPS panel\r\n\r\nBoost gaming experience: Freesync and 144Hz refresh rate for smooth and clear images. BenQ proprietary features further Boost your gaming experience\r\n\r\nEasy access to Fit settings: Use a remote control, 5-Key navigator, or a volume wheel to access your preferred settings in a simple and quick way","price":" 50000","image":" monitor.jfif"},{"id":"0.8702140215309435","title":" SSD","desc":" Sabrent 2TB Rocket NVMe 4.0 Gen4 PCIe M.2 Internal SSD Extreme Performance Solid State Drive (SB-ROCKET-NVMe4-2TB)\r\n\r\nPower Management Support for APST / ASPM / L1.2.\r\nSupports SMART and TRIM commands. Supports ONFi 2.3, ONFi 3.0, ONFi 3.2 and ONFi 4.0 interface.\r\nAdvanced Wear Leveling, Bad Block Management, Error Correction Code, and Over-Provision.\r\nUpgradeable Firmware.","price":" 9999","image":" ssd.jpg"},{"id":"0.7910544093229559","title":" Razer's HeadSet","desc":" For warranty and product related queries please contact us at +912249461882\r\nSuper extra bass: - enjoy powerful, dynamic sound with punchy bass and clear, natural vocals with the responsive 40mm neodymium drivers, balanced sound for a complete listening experience from 20 - 20, 000 hz\r\nFeather light - the sleek, lightweight and compact design makes portability extremely convenient\r\nSnug fit - the on-ear headphones with swivel ear cups offers flexible wearing and a comfortable fit for everyone\r\nCompact and foldable - easy to carry, easy to store headphones are engineered for music on the go\r\nIn-line microphone - the tangle-resistant cable with 3.5mm audio jack comes with a built-in mic and control for calls and playback","price":" 5900","image":" headphone.jpg"},{"id":"0.0028498378237207245","title":"GEFORCE RTX 2080","desc":"More CUDA cores, more Ray-Tracing units, more Tensor Cores as well as increased Base- and Boost Clocks: All of the above and more are on offer in the form of NVIDIA's new series of SUPER graphics cards, summoning forth even more power from the Turing architecture. The RTX SUPER graphics cards can, thanks to the increased number of CUDA Cores, offer even greater computational performance. Furthermore, thanks to the increased number of cores available, the cards have demonstrated their ability to perform at higher clock frequencies compared to standard non-SUPER models. Due to the added ray-tracing cores, users will benefit from the extra horsepower available for displaying realistic shadows and lighting effects. The increased number of Tensor cores on the other hand will bring improvements when it comes to the anti-aliasing of geometric objects.","price":"69900","image":"rtx.jpg"},{"id":"0.2712834964109745","title":"Gaming Mouse","desc":"The latest Kone AIMO comes hard-wired with a very nice quality black braided cable. The cable is slim and light too, so it’s unlikely to drag while you’re gaming.\r\nIt’s easy to see that this is a Roccat mouse. It borrows many design elements from their existing range. However, it seems to have a bolder and more aggressive stance, and I certainly approve of that. Comfort isn’t compromised though, as the surfaces are smooth and curved where you want them to be, providing great ergonomics.\r\nWhile the mouse does feature two large navigation button on the side, it also features a third button at the bottom. This thumb key is fantastic for additional macros and shortcuts; perfect for setting a melee attack in FPS games too. I have mine set as the Enter key, handy for progressing steps in my Photoshop macros.","price":"3900","image":"mouse.jpg"},{"id":"0.7534914606241494","title":"Creeper T Shirt","desc":"Minecraft Creeper Luminous T Shirt for men and women, summer New High quality men T shirt casual short sleeve o-neck 100% cotton t-shirt men brand black tee shirt.\r\n\r\n100% cotton\r\nMinecraft Creeper Luminous T Shirt for men and women.\r\n","price":"1500","image":"shirt.jpg"}]